app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("created_at", "email", "name", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", "2014-07-03 16:32:38.788751"], ["email", "dinesh@GMAIL.COM"], ["name", "dinesh"], ["updated_at", "2014-07-03 16:32:38.788751"]]